bobmittmann/yard-ice/src/test/stm32f405-dk/rs485-capture/rs485-capture.c
/* 
 * File:	 usb-test.c
 * Author:   Robinson Mittmann (bobmittmann@gmail.com)
 * Target:
 * Comment:
 * Copyright(C) 2011 Bob Mittmann. All Rights Reserved.
 *
 * This program is free software; you can redistribute it and/or
 * modify it under the terms of the GNU General Public License
 * as published by the Free Software Foundation; either version 2
 * of the License, or (at your option) any later version.
 *
 * This program is distributed in the hope that it will be useful,
 * but WITHOUT ANY WARRANTY; without even the implied warranty of
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
 * GNU General Public License for more details.
 *
 * You should have received a copy of the GNU General Public License
 * along with this program; if not, write to the Free Software
 * Foundation, Inc., 59 Temple Place - Suite 330, Boston, MA  02111-1307, USA.
 */

#include <sys/stm32f.h>
#include <arch/cortex-m3.h>
#include <sys/delay.h>
#include <sys/serial.h>
#include <sys/param.h>
#include <sys/file.h>
#include <stdlib.h>
#include <stdio.h>
#include <string.h>
#include <stdbool.h>

#include <sys/usb-cdc.h>
#include <sys/tty.h>

#include <thinkos.h>
#define __THINKOS_IRQ__
#include <thinkos_irq.h>

#include "io.h"

/*****************************************************************************
 * Console 
 * ----------------------------------------------------------------------
 *****************************************************************************/

#define USART1_TX STM32F_GPIOB, 6
#define USART1_RX STM32F_GPIOB, 7

struct file stm32f_uart1_file = {
	.data = STM32F_USART1, 
	.op = &stm32f_usart_fops 
};

void stdio_init(void)
{
	struct stm32f_usart * uart = STM32F_USART1;

	/* USART1_TX */
	stm32f_gpio_mode(USART1_TX, ALT_FUNC, PUSH_PULL | SPEED_LOW);

	stm32f_gpio_mode(USART1_RX, ALT_FUNC, PULL_UP);
	stm32f_gpio_af(USART1_RX, GPIO_AF7);
	stm32f_gpio_af(USART1_TX, GPIO_AF7);

	stm32f_usart_init(uart);
	stm32f_usart_baudrate_set(uart, 115200);
	stm32f_usart_mode_set(uart, SERIAL_8N1);
	stm32f_usart_enable(uart);

	stderr = &stm32f_uart1_file;
	stdin = stderr;
	stdout = stdin;
}

/*****************************************************************************
  Timer
 *****************************************************************************/

static inline uint32_t timer_ts(void)
{
	struct stm32f_tim * tim = STM32F_TIM5;

	return tim->cnt;
}

#define TIMESTAMP_FREQ 1000000

static void timer_init(void)
{
	struct stm32f_rcc * rcc = STM32F_RCC;
	struct stm32f_tim * tim = STM32F_TIM5;
	uint32_t div;

	/* get the total divisior */
	div = (stm32f_tim1_hz + (TIMESTAMP_FREQ / 2)) / TIMESTAMP_FREQ;

	/* Timer clock enable */
	rcc->apb1enr |= RCC_TIM5EN;
	
	/* Timer configuration */
	tim->psc = div - 1;
	tim->arr = 0xffffffff;
	tim->cnt = 0;
	tim->egr = 0;
	tim->dier = 0;
	tim->cr2 = 0;
	tim->cr1 = TIM_CEN; /* Enable counter */

	tim->egr = TIM_UG; /* Update registers */
}

/*****************************************************************************
  Fifo
 *****************************************************************************/

#define FIFO_LEN 256

struct fifo {
	volatile uint32_t head;
	volatile uint32_t tail;
	uint8_t data[FIFO_LEN];
	uint32_t time[FIFO_LEN];
};

static inline void fifo_init(struct fifo * fifo)
{
	fifo->head = 0;
	fifo->tail = 0;
}

static inline int fifo_get(struct fifo * fifo, uint32_t * ts)
{
	uint32_t tail = fifo->tail;
	int c;

	c = fifo->data[tail & (FIFO_LEN - 1)];
	*ts = fifo->time[tail & (FIFO_LEN - 1)];

	fifo->tail = tail + 1;
	return c;
}

static inline void fifo_put(struct fifo * fifo, int c, uint32_t ts)
{
	uint32_t head = fifo->head;

	fifo->data[head & (FIFO_LEN - 1)] = c;
	fifo->time[head & (FIFO_LEN - 1)] = ts;

	fifo->head = head + 1;
}

static inline bool fifo_is_empty(struct fifo * fifo)
{
	return (fifo->tail == fifo->head) ? true : false;
}

static inline bool fifo_is_full(struct fifo * fifo)
{
	return ((fifo->head - fifo->tail) == FIFO_LEN) ? true : false;
}

/*****************************************************************************
  RS485
 *****************************************************************************/

#define USART2_TX STM32F_GPIOA, 2
#define USART2_RX STM32F_GPIOA, 3

#define LINK_TXEN STM32F_GPIOA, 1
#define LINK_LOOP STM32F_GPIOA, 0 

struct {
	struct fifo rx_fifo;
	int rx_flag;
} rs485;

void stm32f_usart2_isr(void)
{
	struct stm32f_usart * uart = STM32F_USART2;
	uint32_t sr;
	uint32_t ts = 0;
	int c;
	
	sr = uart->sr & uart->cr1;

	if (sr & USART_RXNE) {
		ts = timer_ts();
		c = uart->dr;
		if (!fifo_is_full(&rs485.rx_fifo)) { 
			fifo_put(&rs485.rx_fifo, c, ts);
		}
		__thinkos_flag_signal(rs485.rx_flag);
	}	
}

void rs485_init(unsigned int speed)
{
	struct stm32f_usart * uart = STM32F_USART2;
	unsigned int real_speed;
	int err;
	int c;

	rs485.rx_flag = thinkos_flag_alloc(); 

	/* IO init */
	stm32f_gpio_mode(USART2_TX, ALT_FUNC, PUSH_PULL | SPEED_LOW);
	stm32f_gpio_mode(USART2_RX, ALT_FUNC, PULL_UP);
	stm32f_gpio_af(USART2_RX, GPIO_AF7);
	stm32f_gpio_af(USART2_TX, GPIO_AF7);

	stm32f_gpio_mode(LINK_TXEN, OUTPUT, PUSH_PULL | SPEED_LOW);
	stm32f_gpio_mode(LINK_LOOP, OUTPUT, PUSH_PULL | SPEED_LOW);

	stm32f_gpio_set(LINK_LOOP);
	stm32f_gpio_set(LINK_TXEN);

	cm3_irq_pri_set(STM32F_IRQ_USART2, IRQ_PRIORITY_HIGH);
	cm3_irq_enable(STM32F_IRQ_USART2);

	stm32f_usart_init(uart);
	stm32f_usart_baudrate_set(uart, speed);
	stm32f_usart_mode_set(uart, SERIAL_8N1);

	real_speed = stm32f_usart_baudrate_get(uart);
	err = 1000 - ((speed * 1000) / real_speed);

	printf("%s: speed: set=%d get=%d err=%d.%d%%.\n", 
		   __func__, speed, real_speed, err / 10, err % 10);

	/* enable RX interrupt */
	uart->cr1 |= USART_RXNEIE;

	/* clear pending data */
	c = uart->dr;
	(void)c;
	c = uart->dr;
	(void)c;

	fifo_init(&rs485.rx_fifo);

	stm32f_usart_enable(uart);
	cm3_irq_enable(STM32F_IRQ_USART2);

}

void rs485_putc(int c)
{
	struct stm32f_usart * uart = STM32F_USART2;
	
	uart->dr = c;
}

/*****************************************************************************
  USB
 *****************************************************************************/

//#define CLT_RAND_MAX 0xfffffffffffffLL
#define CLT_RAND_MAX 0x7fffffffLL

/* Random number generator
   Aproximation of Normal Distribution using Center Limit Theorem. */
int32_t clt_rand(uint64_t * seedp, int32_t max) 
{
	uint64_t randseed  = *seedp;
	uint64_t val = 0;
	int i;

	for (i = 0; i < 16; ++i) {
		randseed = (randseed * 6364136223846793005LL) + 1LL;
		val += (randseed >> 16) & CLT_RAND_MAX;
	}

	*seedp = randseed;
	val = (val * (int64_t)max) / (16LL * (CLT_RAND_MAX + 1));

	return val;
}

static struct {
	int flag;
	volatile bool en;
	uint64_t seed;
} loopback;

int loopback_task(FILE * f)
{
	unsigned int seq = 0;
	unsigned int delay = 0;

	for (;;) {
		do {
			thinkos_flag_wait(loopback.flag);
			__thinkos_flag_clr(loopback.flag);
		} while (!loopback.en);

		fprintf(f, "Loopback test start.\n");

		while (loopback.en) {
//			delay = (rand() & 0x3f) + 1;
			delay = clt_rand(&loopback.seed, 100) + 1;
			led_flash(LED_I2S, 50);
			rs485_putc((seq & 0x7f) | 0x80);
			thinkos_sleep(delay);
			rs485_putc(seq & 0x7f);
			seq++;
	//		thinkos_sleep(100 - delay);
			thinkos_sleep(1);
		}

		__thinkos_flag_clr(loopback.flag);

		fprintf(f, "Loopback test stop.\n");
	};

	return 0;
}


void loopback_start(void)
{
	loopback.en = true;
	thinkos_flag_set(loopback.flag);
}

void loopback_stop(void)
{
	if (loopback.en)  {
	loopback.en = false;
	thinkos_flag_set(loopback.flag);
	}
}

#define BIN_RES 100
#define BIN_CNT 5000

struct {
	uint32_t error;
	uint32_t match;
	int32_t dt_max;
	int32_t dt_min;
	int32_t dt_avg;
	int64_t dt_sum;
	uint32_t bin[BIN_CNT];
} stat;

void stat_clear(void)
{
	int i;

	stat.error = 0;
	stat.match = 0;
	stat.dt_min = 100000000;
	stat.dt_max = 0;
	stat.dt_avg = 0;
	stat.dt_sum = 0;

	for (i =0; i < BIN_CNT; ++i) {
		stat.bin[i] = 0;
	}
}

void stat_show(FILE * f)
{
	if (stat.match > 0) {
		stat.dt_avg = (int64_t)(stat.dt_sum / (int64_t)stat.match);
	}

	fprintf(f, "---- Statistics ----------\n");
	fprintf(f, "  Error: %d\n", stat.error);
	fprintf(f, "  Match: %d\n", stat.match);
	fprintf(f, "    Min: %d\n", stat.dt_min);
	fprintf(f, "    Max: %d\n", stat.dt_max);
	fprintf(f, "    Avg: %d\n", stat.dt_avg);
}

void stat_hist_show(FILE * f)
{
	int l;
	int h;
	int i;
	int j;
	int range;
	int step;
	int n;
	int32_t t;
	uint32_t sum;
	uint32_t max;
	uint32_t bin[80];
	char s[128];

	for (l = 0; l < BIN_CNT; ++l) {
		if (stat.bin[l] > 0)
			break;
	}

	for (h = BIN_CNT - 2; h >= 0; --h) {
		if (stat.bin[h] > 0)
			break;
	}

	range = h - l + 1;
	n = 40;
	step = (range + n - 1) / n;
	range = n * step;
	/* adjust high limit */
	h = l + range;
	fprintf(f, "Lo=%d Hi=%d Step=%d Range=%d\n", l, h, step, range);
	if (h >= BIN_CNT) {
		fprintf(f, "FIXME: adjust range!!!!\n");
		return;
	}

	fprintf(f, "---- Histogram ----------\n");

	max = 0;
	for (i = 0; i < n; ++i) {
		sum = 0;
		t = l + i * step;
		for (j = 0; j < step; ++j) {
			sum += stat.bin[t + j];
		}
		bin[i] = sum;
		if (sum > max)
			max = sum;
	}

	for (i = 0; i < n; ++i) {
		t = l + i * step;
		for (j = 0; j < (bin[i] * 64) / max; ++j)
			s[j] = '#';
		s[j] = '\0';

		fprintf(f, "%d.%d %s\n", t / 10, t % 10, s);
	}
}

void show_menu(FILE * f)
{
	fprintf(f, "\n");
	fprintf(f, " Options:\n");
	fprintf(f, " --------\n");
	fprintf(f, "   l    - Run loopback test\n");
	fprintf(f, "   s    - Show statistics\n");
	fprintf(f, "   c    - Clear statistics\n");

	fprintf(f, "\n");
}

int input_task(FILE * f)
{
	FILE * f_raw;
	unsigned int n;
	int c;

	if (isfatty(f)) {
		f_raw = ftty_lowlevel(f);
	} else {
		f_raw = f;
	}

	for (n = 0; ; ++n) {
		thinkos_sleep(100);
		c = fgetc(f_raw);
		loopback_stop();
		switch (c) {
		case '\r':
			show_menu(f);
			break;
		case 'l':
			loopback_start();
			break;
		case 's':
			stat_show(f);
			break;
		case 'c':
			stat_clear();
			break;
		case 'h':
			stat_hist_show(f);
			break;
		}
	}

	return 0;
}

int ui_task(FILE * f)
{
	int event;
	int c = 0;

	for (;;) {

		/* wait for a push buton event */
		event = btn_event_wait();

		switch (event) {
		case EVENT_CLICK:
			led_flash(LED_I2S, 100);
			rs485_putc((c & 0x7f) | 0x80);
			thinkos_sleep(10);
			rs485_putc(c & 0x7f);
			c++;
			break;

		case EVENT_DBL_CLICK:
			fprintf(f, "------------------------------------\n");
			break;

		case EVENT_HOLD1:
			break;

		case EVENT_CLICK_N_HOLD:
			break;

		case EVENT_HOLD2:
			break;
		}
	}

	return 0;
}

int monitor_task(void * arg)
{
	unsigned int sec = 0;
	unsigned int min = 0;
	unsigned int hour = 0;

	for (;;) {
		thinkos_sleep(1000);
		led_flash(LED_I2S, 100);
		if (++sec == 60) {
			sec = 0;
			if (++min == 60) {
				min = 0;
				hour++;
			}
			printf("-- %2d:%02d --------------\n", hour, min);
		}
	};

	return 0;
}

#define STACK_SIZE 512
#define INPUT_STACK_SIZE 2048
uint32_t input_stack[INPUT_STACK_SIZE / 4];
uint32_t monitor_stack[STACK_SIZE / 4];
uint32_t ui_stack[STACK_SIZE / 4];
uint32_t loopback_stack[STACK_SIZE / 4];

int main(int argc, char ** argv)
{
	usb_cdc_class_t * cdc;
	struct tty_dev * tty;
	FILE * f_raw;
	FILE * f;
	int i;
	int c[2];
	uint32_t ts[2];
	int32_t dt;

	cm3_udelay_calibrate();

	thinkos_init(THINKOS_OPT_PRIORITY(8) | THINKOS_OPT_ID(7));

	io_init();
	led_on(LED_NET);

	stdio_init();

	led_on(LED_I2S);

	timer_init();

	printf("1. usb_cdc_init()...\n");
	cdc = usb_cdc_init(&stm32f_otg_fs_dev, *((uint64_t *)STM32F_UID));

	led_on(LED_S2);

	printf("2. usb_cdc_fopen()...\n");
	f_raw = usb_cdc_fopen(cdc);

	led_on(LED_S1);

	tty = tty_attach(f_raw);

	printf("3. tty_fopen()...\n");
	f = tty_fopen(tty);

	thinkos_thread_create((void *)input_task, (void *)f, 
						  input_stack, sizeof(input_stack), 1);

	thinkos_thread_create((void *)monitor_task, (void *)NULL, 
						  monitor_stack, STACK_SIZE, 2);

	printf("4. rs485_init()...\n");
//	rs485_init(110000000 / (13 * 16));
	rs485_init(500000);

	thinkos_thread_create((void *)ui_task, (void *)f, 
						  ui_stack, STACK_SIZE, 3);

	loopback.flag = thinkos_flag_alloc();
	loopback.en = false;
	loopback.seed = 1LL;
	thinkos_thread_create((void *)loopback_task, (void *)f, 
						  loopback_stack, STACK_SIZE, 4);

	thinkos_sleep(100);
	led_off(LED_NET);
	led_off(LED_I2S);
	led_off(LED_S1);
	led_off(LED_S2);

	stat_clear();

	ts[0] = timer_ts();
	c[0] = 0;
	fprintf(f, "\n------------------------------------\n");
	fprintf(f, "RS485 capture\n");
	fprintf(f, "------------------------------------\n\n");
	for (i = 0; ;i++) {
		while (fifo_is_empty(&rs485.rx_fifo)) {
			thinkos_flag_wait(rs485.rx_flag);
			__thinkos_flag_clr(rs485.rx_flag);
		}
		led_flash(LED_NET, 50);

		ts[1] = ts[0];
		c[1] = c[0];
		c[0] = fifo_get(&rs485.rx_fifo, ts);
		dt = (int32_t)ts[0] - ts[1];
		if (!(c[0] & 0x80)) {
			if (c[1] & 0x80) {
				if ((c[0] & 0x7f) == (c[1] & 0x7f)) {
					int idx;
//					printf("%4d %8d %02x\n", i, dt, c[0]);
					stat.match++;
					fprintf(f, "%4d %3d %8d\n", 
							stat.match, c[0] & 0x7f, dt);
	
					idx = dt / BIN_RES;
					if (idx >= BIN_CNT)
						idx = BIN_CNT - 1;
					stat.bin[idx]++;
					stat.dt_sum += dt;
					if (dt > stat.dt_max)
						stat.dt_max = dt;
					if (dt < stat.dt_min)
						stat.dt_min = dt;
					led_flash(LED_S2, 50);
				} else {
					/* Numbers do not match!!! */
					led_flash(LED_S1, 50);
					stat.error++;
				}
			} else {
				/* previous was not master ??? */
				led_flash(LED_S1, 50);
				stat.error++;
			}
		} else {
			if (c[1] & 0x80) {
				/* master repeated */
				led_flash(LED_S1, 50);
				stat.error++;
			}
		}
	}

	return 0;
}

